# ЗАДАНИЕ 1 : СПРОСИТ ИМЯ И ВЫВЕДЕТ ПРИВЕТСТВИЕ 

# name = input('Как тебя зовут?')
# print('Соси хуй,', name)



# ЗАДАНИЕ 2 : СПРОСИТ ИМЕНА ДВУХ ТИПОВ

# name1 = input('Как твое имя?')
# name2 = input('А тебя как зовут?')
# city = 'мурино'
# print('Хорошо.', ' Тогда', name1, 'пошел нахуй','A', name2, 'устроил раскид на', city)



# ЗАДАНИЕ 3 : ИЗМЕНЕНИЕ ЗНАЧЕНЯ ПЕРЕМЕННОЙ 

# name = input('Как тебя зовут?')
# print('Приятно познакомится', name)
# name = input('Как тебя зовут после смены пола?')
# print('пошла нахуй', name, 'трансуха')


# ЗАДАНИЕ 4 : ДВЕ СТРОКИ ВВОДА

# eat = input("Че ты любишь похавать?")
# drink = input("А попить ты что любишь?")
# print('получается ты любишь похавать', eat, 'и выпить', drink)