#ФУНКЦИЯ input()

#УМНЫЙ ПРИМЕР(Лёнин)
# age = input('Введи свой возраст =) ')
# print('Тебе ', age)

# ПРИМЕР С САЙТА
# print('Как тебя зовут?')
# print('Привет', input())


#ПЕРЕМЕННЫЕ

# city ='Мурино'
# print('Раскид на', city)
#можно ипользовать нескольно переменных в одном print()

# name = 'Юра'
# city = 'Мурино'
# print(name, 'устроил раскид', '.', city, 'в опасности') 


#значения переменной можно менять 
# print('Как теб зовут?')

# name = input()
# print('Привет ,', name)

# name = 'Юра'
# print('Пшел нахуй ,', name)


#name1 всегда будет последним значением 
# name1 = 'Тимур'
# name2 = name1
# name1 = 'Гвидо'

# print(name1)
# print(name2)


# МОЖНО НЕ ПИСАТЬ PRINT() , А СРАЗУ НАПИСАТЬ : 
# name=input('Как тебя зовут ?')



# Можно принимать несколько строк , а потом со всеми ними работать
# first = input()
# second = input()

# print('Меня зовут', first, 'и я делаю', second)


#ПЕРЕМЕННЫЕ МОЖНО ВВОДИТЬ НЕ ТОЛЬКО В НАЧАЛЕ ПРОГРАММЫ
# name_1 = input()
# #имя первого чела
# print('Соси хуй, ', name_1, '!!!')

# name_2 = input()
# #имя второго чела
# print('Ты крутой, ', name_2, '!!!')


