# ВЫВОД ДАННЫХ , КОМАНДА print()



# print('Лёня лучший учитель по python =)') #'Лёня лучший учитель по python =)'-- аргумент команды
# print('Лёня самый лучший ', 'классный', 'прекрасный', 'учитель по пайтон =)')



# Каждая последующая команда print() выводит указанный текст с новой строки.
# print('тралалело-тралала!')
# print('лирили-ларила!')



# команда print() с пустым списком аргументов просто оставляет новую пустую строку
# print('юрец')
# print()
# print('попец')



# print('Текст с "двойными" кавычками') # использовать одинарные кавычки для оформления текста с двойными кавычками 
# print("Текст с 'одинарными' кавычками ") # использовать двойные кавычки для оформления текста с одинарными кавычками



# в одном print() можно комбинировать разные кавычки . Это делает код более гибким
# print("I'm", 'a', "HOT", 'pig')

#СТРОКИ ВСЕГДА ДОЛЖНЫ БЫТЬ ЗАКЛЮЧЕНВ В КАВЫЧКИ 

#ПРОВЕРКА ПРОЙДЕННОГО МАТЕРИАЛА НА САЙТЕ ПО print() (решаю примеры с теста)
# print("I'm", 'Just', 'Ken', "!") 
# print('Hello, it's me!') # НЕПРАВИЛЬНО - ПРОИЗОЙДЕТ ОШИБКА



# print('a', 'b', 'c', sep='*')
# print('d', 'e', 'f', sep='**', end='')
# print('g', 'h', 'i', sep='+', end='%')
# print('j', 'k', 'l', sep='-', end='\n')
# print('m', 'n', 'o', sep='/', end='!')
# print('p', 'q', 'r', sep='1', end='%')
# print('s', 't', 'u', sep='&', end='\n')
# print('v', 'w', 'x', sep='%')
# print('y', 'z', sep='/', end='!')


print('a_b_c', end='')
print('!')