#                                                  УСЛОВНЫЙ ОПЕРАТОР if 

# В ПАЙТОН СУЩЕСТВУЕТ НЕСКОЛЬКО СПОСОБОВ ПРОВЕРКИ , И В КАЖДОМ ВОЗМОЖНЫ ТОЛЬКО ДВА ИСХОДА True ИЛИ False
# ПРОВЕРКА УСЛОВИЙ И ПРИНЯТИЕ РЕШЕНИЙ ПО РЕЗУЛЬТАТОМ НАЗЫВАЕТСЯ ВЕТВЛЕНИЕМ (BRANCHING)
# В ПАЙТОН ПРОВЕРКА УСЛОВИЙ ПРОИСХОДИТ С ПОМОШЬЮ КЛЮЧЕВОГО СЛОВА if



# answer = input('Какой язык программирования мы изучаем?')
# if answer == 'Python': 
#      print('Верно!Мы работаем с Python =)')
#      print('Python - отличный язык!')

# ДВОЕТОЧИЕ В КОНЦЕ СТРОКИ С if НУЖНО ДЛЯ ТОГО ЧТО БЫ ИНТЕРПРЕТАТОР PYTHON ПОНЯЛ , ЧТО ДАЛЬШЕ НАХОДИТСЯ БЛОК КОМАНД 
# В БЛОК КОМАНД ВХОДЯТ ВСЕ СТРОКИ С ОТСТУПОМ ПОД СТРОКОЙ С ИНСТРУКЦИЕЙ if
# ЕСЛИ УСЛОВИЕ ИСТИННО ТО ВЫПОЛНЯЕТСЯ БЛОК КОДА ЧТО ПОД if
# БЛОКОМ КОДА НАЗЫВАЮТ ОБЪЕДИНЕННЫЕ ДРУГ С ДРУГОМ СТРОКИ . ОНИ ВСЕГДА СВЯЗАНЫ С ОПРЕДЕЛЕННОЙ ЧАСТЬЮ КОДА (НАПРИМЕР С ИНСТРУКЦИЕЙ if)
# В ПАЙТОН БЛОКИ КОДА ФОРМИРУЮТСЯ С ПОМОЩЬЮ ОТСТУПОВ


# ПРЕДЫДУЩАЯ ПРОГРАММА ВЫВОДИТ ТЕКСТ ТОЛЬКО ЕСЛИ УСЛОВИЕ ИСТИННО, ЕСЛИ УСЛОВИЕ ЛОЖНО, ТО ОНА НИЧЕГО НЕ ВЫВЕДЕТ 

# ДЛЯ ТОГО ЧТО БЫ ПРОГРАММА ВЫВОДИЛА ЧТО ТО ПРИ ЛОЖНОМ ЗНАЧЕНИИ МЫ ИСПОЛЬЗУЕМ КЛЮЧЕВОЕ СЛОВО else


# answer = input('Какой язык программирования мы изучаем?')
# if answer == 'Python': 
#      print('Верно!Мы работаем с Python =)')
#      print('Python - отличный язык!')
# else :
#     print('Не совсем так!')

# ОТСТУПЫ В ПАЙТОН ОБЯЗАТЕЛЬНЫ , ИМЕННО ОНИ СООБЩАЮТ ИНТЕРПРЕТАТОРУ ГДЕ НАЧИНАЕТСЯ НОВЫЙ БЛОК КОДА



#                                                 ОПЕРАТОРЫ СРАВНЕНИЯ 

# = ОПЕРАТОР ПРИСВАИВАНИЯ
# == (УСЛОВНЫЙ) ОПЕРАТОР СРАВНЕНИЯ

# Для проверки двух элементов на равенство Python использует удвоенный знак равно. ВОТ ТАК:

# if answer == 'Python':
#     ...

# if name == 'Gvido':
#     ...

# if temperature == 40:
#     ...


# оператор сравнения ==
# оператор не равенства !=
# больше >
# меньше <
# больше либо равно >=
# меньшк либо равно <=



# рассмотрим пример 
 
# num1 = int(input()) 
# num2 = int(input())

# if num1 < num2:
#     print(num1, 'меньше чем', num2)
# if num1 > num2:
#     print(num1, 'больше чем', num2)

# if num1 == num2:
#     print(num1, 'ravno', num2)
# if num1 != num2:
#     print(num1, 'ne ravno', num2)        



#                                                 ЦЕПОЧКИ СРАВНЕНИЯ

# ОПЕРАТОРЫ СРАВНЕНИЯ В ПАЙТОН МОЖНО ОБЪЕДИНЯТЬ В ЦЕПОЧКИ , НАПРИМЕР , a == b == c или 1 <= x <= 10
# СЛЕДУЮЩИЙ КОД ПРОВЕРЯЕТ , НАХОДИТСЯ ЛИ ЗНАЧЕНИЕ ПЕРЕМЕННОЙ age В ДИАПОЗОНЕ ОТ 3 ДО 6

# age = int(input())
# if 3 <= age <= 6 :
#     print('Вы ребенок')

# КОД ПРОВЕРЯЮЩИЙ РАВЕНСТВО ТРЕХ ПЕРЕМЕННЫХ МОЖЕТ ВЫГЛЯДЕТЬ ТАК:

# if a == b == c :
#     print('Числа равны')
# else : 
#     print('Числа не равны')



#                                                 ТРАНЗИТИВНОСТЬ 

# ОПЕРАЦИЯ РАВЕНСТВА ЯВЛЯЕТСЯ ТРАНЗИТИВНОЙ.ЭТО ОЗНАЧАЕТ ЧТО A == B == C , ИЗ ЭТОГО СЛЕДУЕТ ЧТО А == С

# ОПЕРАЦИЯ НЕ РАВЕНСТВА (!=) НЕ ЯВЛЯЕТСЯ ТРАНЗИТИВНОЙ 
# ТО ЕСТЬ ЕСЛИ А != В != С , СОВСЕМ НЕ ЗНАЧИТ ЧТО А != С . ТАКИМ ОБРАЗОМ ЛЕДУЮЩИЙ КОД НЕ ПРОВЕРЯЕТ ТОТ ФАКТ , ЧТО ВСЕ ТРИ ПЕРЕМЕННЫХ РАЗЛИЧНЫ

# if a != b != c :
#     print('chisla ne ravni')
# else :
#     print('chisla ravni')












