

# Задача 1.1 - Проверка температуры
# Напишите программу, которая считывает температуру воды и определяет ее состояние:
# Если температура меньше 0, вывести "Лёд"
# Если температура от 0 до 100 (включительно), вывести "Вода"
# Если температура больше 100, вывести "Пар"

# temp = int(input())

# if temp < 0 : 
#     print('ICE')
# if temp >= 0 and temp <= 100 : 
#     print('WATER')
# if temp > 100 :
#     print('STEAM')




# Задача 1.2 - Калькулятор скидки
# Напишите программу, которая считывает стоимость покупки. 
# Если стоимость больше или равна 1000 рублей, программа выводит стоимость со скидкой 10%. Иначе выводит стоимость без изменений.

# price = int(input())

# if price >= 1000 :
#     print(price - (price // 10))
# else : 
#     print(price)




# Задача 1.3 - Четное или нечетное место
# Напишите программу, которая считывает номер места в кинотеатре.
# Если номер четный, выводит "Левый ряд", если нечетный - "Правый ряд".

# place = int(input())

# if place % 2 == 0 :
#     print('LEFT')
# else : 
#     print('RIGHT')




# Задача 1.4 - Сравнение трех чисел
# Напишите программу, которая считывает три числа и выводит наибольшее из них.

# num1, num2, num3 = int(input()), int(input()), int(input())

# if num1 > num2 > num3 : 
#     print(num1)
# if num1 > num3 > num2 :
#     print(num1)    
# if num2 > num3 > num1 : 
#     print(num2)
# if num2 > num1 > num3 : 
#     print(num2)        
# if num3 > num2 > num1 : 
#     print(num3)
# if num3 > num1 > num2 :
#     print(num3)




# Задача 1.5 - Проверка пятизначного числа
# Напишите программу, которая проверяет, является ли число пятизначным (от 10000 до 99999).

# num = int(input())

# if 99999 >= num >= 10000 : 
#     print('eto chislo norm')

# else : 
#     print('ti pidr')
