#                                                  УСЛОВНЫЙ ОПЕРАТОР if 

# В ПАЙТОН СУЩЕСТВУЕТ НЕСКОЛЬКО СПОСОБОВ ПРОВЕРКИ , И В КАЖДОМ ВОЗМОЖНЫ ТОЛЬКО ДВА ИСХОДА True ИЛИ False
# ПРОВЕРКА УСЛОВИЙ И ПРИНЯТИЕ РЕШЕНИЙ ПО РЕЗУЛЬТАТОМ НАЗЫВАЕТСЯ ВЕТВЛЕНИЕМ (BRANCHING)
# В ПАЙТОН ПРОВЕРКА УСЛОВИЙ ПРОИСХОДИТ С ПОМОШЬЮ КЛЮЧЕВОГО СЛОВА if



# answer = input('Какой язык программирования мы изучаем?')
# if answer == 'Python': 
#      print('Верно!Мы работаем с Python =)')
#      print('Python - отличный язык!')

# ДВОЕТОЧИЕ В КОНЦЕ СТРОКИ С if НУЖНО ДЛЯ ТОГО ЧТО БЫ ИНТЕРПРЕТАТОР PYTHON ПОНЯЛ , ЧТО ДАЛЬШЕ НАХОДИТСЯ БЛОК КОМАНД 
# В БЛОК КОМАНД ВХОДЯТ ВСЕ СТРОКИ С ОТСТУПОМ ПОД СТРОКОЙ С ИНСТРУКЦИЕЙ if
# ЕСЛИ УСЛОВИЕ ИСТИННО ТО ВЫПОЛНЯЕТСЯ БЛОК КОДА ЧТО ПОД if
# БЛОКОМ КОДА НАЗЫВАЮТ ОБЪЕДИНЕННЫЕ ДРУГ С ДРУГОМ СТРОКИ . ОНИ ВСЕГДА СВЯЗАНЫ С ОПРЕДЕЛЕННОЙ ЧАСТЬЮ КОДА (НАПРИМЕР С ИНСТРУКЦИЕЙ if)
# В ПАЙТОН БЛОКИ КОДА ФОРМИРУЮТСЯ С ПОМОЩЬЮ ОТСТУПОВ


# ПРЕДЫДУЩАЯ ПРОГРАММА ВЫВОДИТ ТЕКСТ ТОЛЬКО ЕСЛИ УСЛОВИЕ ИСТИННО, ЕСЛИ УСЛОВИЕ ЛОЖНО, ТО ОНА НИЧЕГО НЕ ВЫВЕДЕТ 

# ДЛЯ ТОГО ЧТО БЫ ПРОГРАММА ВЫВОДИЛА ЧТО ТО ПРИ ЛОЖНОМ ЗНАЧЕНИИ МЫ ИСПОЛЬЗУЕМ КЛЮЧЕВОЕ СЛОВО else


# answer = input('Какой язык программирования мы изучаем?')
# if answer == 'Python': 
#      print('Верно!Мы работаем с Python =)')
#      print('Python - отличный язык!')
# else :
#     print('Не совсем так!')

# ОТСТУПЫ В ПАЙТОН ОБЯЗАТЕЛЬНЫ , ИМЕННО ОНИ СООБЩАЮТ ИНТЕРПРЕТАТОРУ ГДЕ НАЧИНАЕТСЯ НОВЫЙ БЛОК КОДА



#                                                 ОПЕРАТОРЫ СРАВНЕНИЯ 

# = ОПЕРАТОР ПРИСВАИВАНИЯ
# == (УСЛОВНЫЙ) ОПЕРАТОР СРАВНЕНИЯ

# Для проверки двух элементов на равенство Python использует удвоенный знак равно. ВОТ ТАК:

# if answer == 'Python':
#     ...

# if name == 'Gvido':
#     ...

# if temperature == 40:
#     ...


# оператор сравнения ==
# оператор не равенства !=
# больше >
# меньше <
# больше либо равно >=
# меньшк либо равно <=



# рассмотрим пример 
 
# num1 = int(input()) 
# num2 = int(input())

# if num1 < num2:
#     print(num1, 'меньше чем', num2)
# if num1 > num2:
#     print(num1, 'больше чем', num2)

# if num1 == num2:
#     print(num1, 'ravno', num2)
# if num1 != num2:
#     print(num1, 'ne ravno', num2)        



#                                                 ЦЕПОЧКИ СРАВНЕНИЯ

# ОПЕРАТОРЫ СРАВНЕНИЯ В ПАЙТОН МОЖНО ОБЪЕДИНЯТЬ В ЦЕПОЧКИ , НАПРИМЕР , a == b == c или 1 <= x <= 10
# СЛЕДУЮЩИЙ КОД ПРОВЕРЯЕТ , НАХОДИТСЯ ЛИ ЗНАЧЕНИЕ ПЕРЕМЕННОЙ age В ДИАПОЗОНЕ ОТ 3 ДО 6

# age = int(input())
# if 3 <= age <= 6 :
#     print('Вы ребенок')

# КОД ПРОВЕРЯЮЩИЙ РАВЕНСТВО ТРЕХ ПЕРЕМЕННЫХ МОЖЕТ ВЫГЛЯДЕТЬ ТАК:

# if a == b == c :
#     print('Числа равны')
# else : 
#     print('Числа не равны')



#                                                 ТРАНЗИТИВНОСТЬ 

# ОПЕРАЦИЯ РАВЕНСТВА ЯВЛЯЕТСЯ ТРАНЗИТИВНОЙ.ЭТО ОЗНАЧАЕТ ЧТО A == B == C , ИЗ ЭТОГО СЛЕДУЕТ ЧТО А == С

# ОПЕРАЦИЯ НЕ РАВЕНСТВА (!=) НЕ ЯВЛЯЕТСЯ ТРАНЗИТИВНОЙ 
# ТО ЕСТЬ ЕСЛИ А != В != С , СОВСЕМ НЕ ЗНАЧИТ ЧТО А != С . ТАКИМ ОБРАЗОМ ЛЕДУЮЩИЙ КОД НЕ ПРОВЕРЯЕТ ТОТ ФАКТ , ЧТО ВСЕ ТРИ ПЕРЕМЕННЫХ РАЗЛИЧНЫ

# if a != b != c :
#     print('chisla ne ravni')
# else :
#     print('chisla ravni')


#                                                  ВЛОЖЕНЫЙ ОПЕРАТОР

# ВНУТРИ УСЛОВНОГО ОПЕРАТОРА МОЖНО ИСПОЛЬЗОВАТЬ ЛЮБЫЕ КОМАНДЫ ПАЙТОН 
# В ТОМ ЧИСЛЕ И САМИ УСЛОВНЫЕ ОПЕРАТОРЫ 

# ПОЛУЧАЕМ ВЛОЖЕНОЕ ВЕТВЛЕНИЕ: В ХОДЕ ИСПОЛНЕНИЯ ПРОГРАММЫ ПОЯВЛЯЕТСЯ ДРУГАЯ РАЗВИЛКА 
# ПРИ ЭТОМ ВЛОЖЕНЫЕ БЛОКИ КОДА ИМЕЮТ БОЛЬШИЙ ОТСТУП (+4 ПРОБЕЛА КАЖДОМУ УРОВНЮ)

# if условие1:
#     блок кода
# else:
#     if условие2:
#         блок кода
#     else:
#         if условие3:
#             блок кода            
#         ...


# В ПРЕДЫДУЩЕМ УРОКЕ БЫЛА ЗАДАЧА ОБ ОПРЕДЕЛЕНИИ КООРДИНАТОНОЙ ЧЕТВЕРТИ ТОЧКИ 
# ЭТУ ПРОГРАММУ МОЖНО ПЕРЕПИСАТЬ С ВЛОЖЕННЫМ ОПЕРАТОРОМ

# x = int(input())
# y = int(input())

# if x > 0 :
#     if y > 0 :
#         print('первая четверть')
#     else :
#             print('четвертая четверть')
# else :
#     if y > 0 :
#         print('вторая четверть')
#     else :
#             print('третья четверть')

# В ДАННОМ СЛУЧАЕ УРОВЕНЬ ВЛОЖЕННОСТИ РАВЕН ДВУМ ПОЭТОМУ ПРОГРАММА НОРМАЛЬНО ЧИТАЕТСЯ И С ЭНД И С ВЛОЖЕНИЕМ




# РАССМОТРИМ ПРОГРАММУ КОТОРАЯ ПЕРЕВОДИТ СТОБАЛЬНУЮ СИСТЕМУ ОЦЕНИВАНИЯ В ПЯТИБАЛЬНУЮ

# grade = int(input('Введите вашу отметку по 100-балльной системе'))

# if grade >= 90 :
#     print(5)
# else:
#     if grade >= 80 :
#         print(4)
#     else:
#         if grade >= 70 :
#             print(3)    
#         else:
#             if grade >= 60 :
#                 print(2)
#             else:
#                 print(1)  




#                                                  КАСКАДНЫЙ УСЛОВНЫЙ ОПЕРАТОР 
# УСЛИ НУЖНО ПРОВЕРИТЬ НЕСКОЛЬКО УСЛОВИЙ ИСПОЛЬЗУЕМ КАСКАДНЫЙ УСЛОВНЫЙ ОПЕРАТОР : elif 

# СИНТАКСИС УСЛОВНОГО КАСКАДНОГО ОПЕРАОРА ИМЕЕТ СЛЕДУЮЩИЙ ВИД 
 
# if условие1:
#     блок кода
# elif условие2:
#     блок кода
# ...
# else:
#     блок кода 

# ПРИ ИСПОЛНЕНИИ ТАКОГО УСЛОВНОГО ОПЕРАТОРА СНАЧАЛА ПРОВЕРЯЕТСЯ УСЛОВИЕ1 
# ЕСЛИ ОНО ЯВЛЯЕТСЯ ИСТННЫМ ТО БЛОК КОДА ИСПОЛНЕЯТСЯ ВПЛОТЬ ДО elif (ОСТАЛЬНАЯ ЧАСТЬ ИГНОРИРУЕТСЯ)
# ОДНАКО ЕСЛИ УСЛОВИЕ1 ЛОЖНО ТО СРАЗУ НАЧИНАЕТ ПРОВЕРЯТСЯ УСЛОВИЕ2 
# ЕСЛИ УСЛОВИЕ2 ИНСТИННО ТО ВЫПОЛНЯЕТСЯ БЛОК КОДА ВПЛОТЬ ДО СЛЕДУЩЕГО elif И ТАК ДАЛЕЕ 
# ЕСЛИ ВСЕ УСЛОВИЯ ЛОЖНЫ ТО ВЫПОЛНЯЕТСЯ БЛОК КОДА ПОСЛЕ else 
 

# СЛЕДУЮЩИЙ КОД ДЕЛАЕТ ТО ЧТО И ПРЕДЫДУЩИЙ , НО ИСПОЛЬЗУЕТ КАСКАДНЫЙ УСЛОВНЫЙ ОПЕРАТОР if-elif-else 

# grade = int(input())

# if grade >=90:
#     print(5)
# elif grade >= 80:
#     print(4)   
# elif grade >= 70:
#     print(3)
# elif grade >= 60:
#     print(2)
# else:
#     print(1)

# else КАК ЗАКЛЮЧИТЕЛЬНЫЙ БЛОК НЕ ЯВЛЯЕТСЯ ОБЯЗАТЕЛЬНЫМ 

# traffic_light_signal = input('введите сигнал светофора')

# if traffic_light_signal == 'red':
#     print('stop')
# elif traffic_light_signal == 'yellow':
#     print('get ready')
# elif traffic_light_signal == 'green':
#     print('go')






 





















































