#                                                         Модуль math
# Модуль math – один из наиважнейших в Python.  
# Этот модуль предоставляет обширный функционал для проведения вычислений с действительными числами.

# Для использования этих функций в начале программы необходимо подключить модуль, что делается командой import:

# import math 

# num1 = math.sqrt(2)    # КВАДРАТНЫЙ КОРЕНЬ  
# num2 = math.ceil(3.8)  # ОКРУГЛЕНИЕ ЧИСЛА ВВЕРХ
# num3 = math.floor(3.8) # ОКРУГЛЕНИЕ ЧИСЛА ВНИЗ

# print(num1)
# print(num2)
# print(num3)





#                                                         Особенности подключения модулей 

# ЧТО БЫ ВЕЧНО НЕ ПИСАТЬ НАЗВАНИЕ МОДУЛЯ И ТОЧКУ ПИШЕМ ВОТ ТАКОЙ КОД :

# from math import * 

# num1 = sqrt(2)     # КВАДРАТНЫЙ КОРЕНЬ  
# num2 = ceil(3.8)   # ОКРУГЛЕНИЕ ЧИСЛА ВВЕРХ
# num3 = floor(3.8)  # ОКРУГЛЕНИЕ ЧИСЛА ВНИЗ

# print(num1)
# print(num2)
# print(num3)



# ЧТО ИМПОРТИРОВАТЬ ТОЛЬКО ОТДЕЛЬНЫЕ ФУНКУЦИИ МОДУЛЯ ПИШЕМ СЛЕДУЮЩИЙ КОД
# from math import sqrt, ceil
# ТЕПЕРЬ МОЖНО ВЫЗЫВАТЬ ЭТИ ФУНКЦИИ БЕЗ ПРЕФИКСА , НО И ФУНКЦИЮ ФЛУР МЫ ИСПОЛЬЗЫВАТЬ НЕ СМОЖЕМ





#                                                         СПИСОК ФУНКЦИЙ МОДУЛЯ 
# Список наиболее часто используемых функций модуля math:

# Функция	
# Округления
# floor(x)	Округляет число x вниз («пол»)
# ceil(x)	Округляет число x вверх («потолок»)

# Корни, логарифмы, степени и факториал
# sqrt(x)	Квадратный корень числа x
# pow(x, n)	Возведение числа x в степень n
# log(x)	Натуральный логарифм числа x. Основание натурального логарифма равно числу e
# log10(x)	Десятичный логарифм числа x. Основание десятичного логарифма равно числу 10
# log(x, b)	Логарифм числа x по основанию b
# factorial(n)	Факториал натурального числа n

# Тригонометрия
# degrees(x)	Преобразует угол x, заданный в радианах, в градусы
# radians(x)	Преобразует угол x, заданный в градусах, в радианы
# cos(x)	Косинус угла x, задаваемого в радианах
# sin(x)	Синус угла x, задаваемого в радианах
# tan(x)	Тангенс угла x, задаваемого в радианах
# acos(x)	Возвращает угол в радианах от 
# 0 до π, cos которого равен x
# asin(x)	Возвращает угол в радианах от 
# −π/2 до π/2 , sin которого равен x
# atan(x)	Возвращает угол в радианах от 
# −π/2 до π/2, tan которого равен x
# atan2(y, x)	Полярный угол (в радианах) точки с координатами (x, y) 



#                                                         СПИСОК ВСЕХ НОСТАНТ МОДУЛЯ 
# pi	Число π = 3.141592653589793 
# e     Число e = 2.71828182845904



# ПРИМЕЧАНИЯ : 
# ДЛЯ ОКРУГЛЕНИЯ ЧИСЕЛ МОЖНО ИСПОЛЬЗОВАТЬ ФУНКЦИИ 
# round(x) (округляет х до ближайшего целого) и round(x, n) (округляет х до n после запятой)





































