# Задача 2.1 - Доступ к аттракциону
# Напишите программу для парка аттракционов. 
# На аттракцион допускаются люди с ростом от 120 см до 200 см И возрастом от 7 лет. 
# Программа считывает рост и возраст и выводит "Допущен" или "Не допущен".

# height = int(input())
# age = int(input())

# if 200 >= height >= 120 and age > 7 :
#     print("Допущен")
# else :
#     print("Не допущен")




# Задача 2.2 - Выходной день
# Напишите программу, которая считывает название дня недели. 
# Если это "Суббота" ИЛИ "Воскресенье", выводит "Выходной", иначе "Рабочий день".

# day = input()

# if day == 'saturday' or day == 'sunday' :
#     print('Выходной')
# else : 
#     print('Рабочий день')




# Задача 2.3 - Магазин работает?
# Магазин работает с 9 до 22 часов, НО не работает в час обеда с 13 до 14. 
# Напишите программу, которая считывает час (число от 0 до 23) и определяет, работает ли магазин.

# hour = int(input())

# if (14 != hour and 13 != hour) and (hour >= 9 and hour <= 22) :
#     print('store is open')
# else :
#     print('store is closed')





# Задача 2.5 - Шоколадка
# Шоколадка имеет размер n×m долек. 
# Можно ли разломить шоколадку на k долек, совершая разломы по прямой между дольками? 
# Программа считывает три числа: n, m, k и выводит YES или NO.
# Подсказка: Нужно проверить, что k меньше n×m И что либо k делится на n, либо k делится на m

# n = int(input()) # длинна  
# m = int(input()) # ширина
# k = int(input()) # на сколько долек разломить

# chocolate = n * m 

# if (k < chocolate) and (k % n == 0 or k % m == 0) :
#     print('YES')
# else :
#     print('NO')




# Задача 3.1 - Определитель квадратного уравнения
# Напишите программу, которая считывает коэффициенты квадратного уравнения a, b, c (ax² + bx + c = 0) и определяет количество корней:
# Если дискриминант (D = b² - 4ac) больше 0, вывести "Два корня"
# Если D равен 0, вывести "Один корень"
# Если D меньше 0, вывести "Нет корней"

# a, b, c = int(input()), int(input()), int(input())
# D = b ** 2 - 4 * a * c 

# if D > 0 :
#     print('dva korna')
# if D == 0 :
#     print('odin koren')
# if D < 0 :
#     print('net koren')

























