#                                                     РЕШЕНИЕ ЗАДАЧ 
# ЗАДАЧА 1 
# НАПИСАТЬ ПРОГРАММУ ЧТО ОПРЕДЕЛЯЕТ ЯВЛЯЕТСЯ ЛИ ЧИСЛО ТРЕХЗНАЧНЫМ 
# ТАКАЯ ПРОГРАММА МОЖЕТ ИМЕТЬ ТАКОЙ ВИД : 
 
# num = int(input()) 

# if 100 <= num <= 999 : # num >= 100 and num <= 999
#     print('Число является трёхзначным')  
# else : 
#     print('Число не является трёхзначным')



# ЗАДАЧА 2 
# НАПИСАТЬ ПРОГРАММУ ЧТО ПРОВЕРЯЕТ  РАЗНЫ ЛИ ВСЕ ЦИФРЫ ТРЕХЗНАЧНОГО ЧИСЛА 

# num = int(input())
# d3 = num % 10 
# d2 = num % 100 // 10 
# d1 = num // 100

# if d3 != d2 and d3 != d1 and d2 != d1 : 
#     print('Цифры различны')
# else :
#     print('Цифры не различны')



# ЗАДАЧА 3 
# НАПИСАТЬ ПРОГРАММУ ЧТО ПО КООРДИНАТАМ ТОЧКИ НЕ ЛЕЖАЩЕЙ НА ОСИ ОПЕРДЕЛЯЕТ НОМЕР КООРДИНАТНОЙ ЧЕТВЕРТИ НА КОТОРОЙ ОНА НАХОДИТСЯ

# x = int(input())
# y = int(input())

# if x > 0 and y > 0 : 
#     print('1 chetvert')
# if x < 0 and y > 0 :
#     print('2 chetvert')
# if x < 0 and y < 0 : 
#     print('3 chetvert')
# if x > 0 and y < 0 :
#     print('4 chetvert')


# print(81 % 9)



# a = int(input()) # a = 7 

# if a >= 2 and a <= 17:
#     b = 3
#     p = a * a + b * b # p = 7 * 7 + 3 * 3 = 58 
# else:
#     b = 5

# p = (a + b) * (a + b) # (7 + 3) * (7 + 3) = 100 
# print(p)




# НАПИСАТЬ ПРОГРАММУ ЧТО ЧИТАЕТ ЧИСЛО Х И ОПРЕДЕЛЯЕТ ПРИНАДЛЕЖИТ ЛИ ОНО К УКАЗАННОМУ ПРОМЕЖУТКУ : -1 , 17 

# x = int(input())

# if -1 < x < 17 : 
#     print('Принадлежит')
# else :
#     print('Не принадлежит')



# НАПИСАТЬ ПРОГРАММУ ЧТО ЧИТАЕТ ЧИСЛО Х И ОПРЕДЕЛЯЕТ ПРИНАДЛЕЖИТ ЛИ ОНО К УКАЗАННЫМ ПРОМЕЖУТКАМ : -3 , 7

# x = int(input())

# if x <= -3 or x >= 7 : 
#     print('Принадлежит')
# else : 
#     print('Не принадлежит')



# НАПИСАТЬ ПРОГРАММУ ЧТО ЧИТАЕТ ЧИСЛО Х И ОПРЕДЕЛЯЕТ ПРИНАДЛЕЖИТ ЛИ ОНО К УКАЗАННЫМ ПРОМЕЖУТКАМ : -30(выколото) , -2(выколото) , 7 , 25 

# x = int(input())

# if (x > -30 and x <= - 2) or (x > 7 and x <= 25): 
#     print('Принадлежит')
# else :
#     print('Не принадлежит')



 
# НАПИСАТЬ ПРОГРАММУ ЧТО ОПРЕДЕЛЯЕТ КРАСИВОЕ ЧИСЛО ИЛИ НЕТ (ОНО ДОЛЖНО ДЕЛИТСЯ НА 7 И 17 БЕЗ ОСТАТКА)

# num = int(input())

# if (num == num >= 1000 and num < 10000) and (num % 7 == 0 or num % 17 == 0 ) :
#     print('YES')
# else : 
#     print('NO')




# НАПИСАТЬ ПРОГРАММУКОТОРАЯ ПРИНИМАЕТ ТРИ ЧИСЛА И ОПРЕДЕЛЯЕТ СУЩЕСТВУЕТ ЛИ НЕВЫРОЖДЕННЫЙ ТРЕУГОЛЬНИК 

# a = int(input())
# b = int(input())
# c = int(input())

# if a + b > c and a + c > b and b + c > a : 
#     print('YES')
# else : 
#     print('NO')




# НАПИСАТЬ ПРОГРАММУ ЧТО ВЫЧИСЛЯЕТ ЯВЛЯЕТСЯ ЛИ ГОД С ДАННЫМ НОМЕРОМ ВЫСОКОСНЫМ 

# year = int(input())

# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0 : 
#     print('YES') 
# else :
#     print('NO')




# НАПИСАТЬ ПРОГРАММУ ЧТО ОПРЕДЕЛЯЕТ МОЖЕТ ЛИ ЛАДЬЯ ШАГНУТЬ С ОДНОЙ КЛЕТКИ НА ДРУГУЮ ОДНИМ ХОДОМ 

# x1 = int(input()) # СТОЛБИК1 
# y1 = int(input()) # СТРОКА1
# x2 = int(input()) # СТОЛБИК2
# y2 = int(input()) # СТРОКА2

# if x1 == x2 or y1 == y2 : # МЫ СРАВНИВАЕМ НАШИ ПЕРЕМЕННЫЕ ПОТОМУ ЧТО ЛАДЬЯ МОЖЕТ ХОДИТЬ ТОЛЬКО ПО ГОРИЗОНТАЛИ И ВЕРТИКАЛИ 
# ТО ЕСТЬ ЛАДЬЯ МОЖЕТ ПОПАСТЬ С ОДНОЙ КЛЕТКИ НА ДРУГУЮ В ОДИН ХОД ТОЛЬКО ЕСЛИ ОНИ РАВНЫ
#     print('YES')
# else : 
#     print('NO')




# НАПИСАТЬ ПРОГРАММУ ЧТО МОЖЕТ ЛИ КОРОЛЬ В ОДИН ШАГ ПОПАСТЬ С ОДНОЙ КЛЕТКИ НА ДРУГУЮ

# x1 = int(input()) # СТОЛБИК1 
# y1 = int(input()) # СТРОКА1
# x2 = int(input()) # СТОЛБИК2
# y2 = int(input()) # СТРОКА2

# if ((-1 <= x1 - x2 <= 1 ) and (-1 <= y1 - y2 <= 1)) or ((-1 <= x2 - x1 <= 1) and (-1 <= y2 - y1 <= 1)) : 
#     print('YES')
# else : 
#     print('NO')





























