#                                                     ОПЕРАТОР and
# Предположим, мы написали программу для учеников от двенадцати лет, которые учатся по крайней мере в 7 классе.
# Доступ к ней тем, кто младше, надо запретить. 
# Следующий код решает поставленную задачу:

# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь? '))

# if age >= 12 and grade >= 7 :
#     print('Доступ разрешен')
# else : 
#     print("Доступ запрещен")

# МЫ  ОБЪЕДЕНИЛИ ДВА УСЛОВИЯ ПРИ ПОМОЩИ AND. 
# ОН  ОЗНАЧАЕТ ЧТО ВЕТВЛЕНИЕ БЛОКА КОДА ВЫПОЛНЯЕТСЯ ТОЛЬКО ПРИ ВЫПОЛНЕНИИ ОБОИХ УСЛОВИЙ 


# ОПЕРАТОР AND МОЖЕТ ОБЪЕДИНЯТЬ ПРОИЗВОЛЬНОЕ КОЛИЧЕСТВО УСЛОВИЙ 

# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь?: '))
# city = input('В каком городе вы живете?: ')

# if age >= 12 and grade >= 7 and city == 'Москва' :
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.') 

# чтобы значение выражения с оператором and было истинным, должны быть истинными все объединенные им условия.




#                                                     ОПЕРАТОР or
# ОПЕРАТОР OR ТАК ЖЕ ИСПОЛЬЗУЕТСЯ ДЛЯ ОБХЕДИНЕНИЯ УСЛОВИЙ 
# НО В ОТЛИЧИИ ОТ AND ЧТО БЫ БЛОК КОДА ДОСТАТОЧНО ВЫПОЛНЕНИЯ ОДНОГО ИЗ УСЛОВИЙ

# city = input('В каком городе вы живете?: ')
# if city == 'Moscov' or city == 'SPB' or city == 'EKB' :
#     print('Доступ разрешен.')
# else : 
#     print('Доступ запрещен.')



# ЛОГИЧЕСКОЕ ВЫРАЖЕНИЕ А and Б ИСТИННО ТОЛЬКО ЕСЛИ ОБА ЗНАЧЕНИЯ ИСТИННЫ 
# ЛОГИЧЕСКОЕ ВЫРАЖЕНИЕ А or Б ИСТИННО ЕСЛИ ЗНАЧЕНИЕ ХОТЯ БЫ ОДНОГО ИЗ НИХ ИСТИННО 
 

# МОЖНО ИСПОЛЬЗОВАТЬ ОПА ЛОГИЧЕСКИХ ОПЕРАТОРА ОДНОВРЕМЕННО 

# age = int(input('Сколько вам лет?: '))
# grade = int(input('В каком классе вы учитесь?: '))
# city = input('В каком городе вы живете?: ')

# if age >= 12 and grade >= 7 and (city == 'Москва' or city == 'SPB') :
#     print('Доступ разрешен.')
# else:
#     print('Доступ запрещен.') 




#                                                     ОПЕРАТОР not 
# ЭТОТ ОПЕРАТОР ПОЗВОЛЯЕТ ИНВЕРТИРОВАТЬ РЕЗУЛЬТАТ ЛОГИЧЕСКОГО ВЫРАЖЕНИЯ 
# НАПРИМЕР 
 
# age = int(input('how old are you'))

# if not(age < 12) : 
#     print('Доступ разрешен.')
# else : 
#     print('Доступ запрещен.')

# ЭТОТ КОД ПОЛНОСТЬЮ ЭКВИВАЛЕНТЕН КОДУ

# age = int(input('how old are you'))

# if age >= 12 : 
#     print('Доступ разрешен.')
# else : 
#     print('Доступ запрещен.')    




# Логические операторы, подобно арифметическим операторам (+, -, *, /), имеют приоритет выполнения. 
# Приоритет выполнения следующий:

# в первую очередь выполняется логическое отрицание not;
# далее выполняется логическое умножение and;
# далее выполняется логическое сложение or.
# Для явного указания порядка выполнения условных операторов используют скобки.




























































