# name = 'Alice'
# age = 25
# print('name, age')


# x = 3 
# y = 4

# x, y = y, x
# print(x, y)



# str-строка
# variable = 'Hello, world'
# print(type(variable))


# преобразовать строку в целое число можно командой/функцией int()
# s = '1992'
# year = int(s)

# print(year)



# что бы через input() ввести число нужно добавить функцию int() , а то программа считает введенные данные как текст , а не число 
# num1 = int(input())
# num2 = int(input())

# print(num1 + num2)



# преобразование целого числа к строке делается с помощью функции str()
# num = 17
# s = str(num)



# int-числа
# my_integer = 10 # целые числа
# my_float = 20.5 # с плавающей точкой



# INTEGER - целые числа
# x = 10
# y = 5
# summery = x + y

# print(summery)



#FLOAT - числа с плавающей точкой/дробные
# x = 7.3
# y = 10.9
# summery = x + y

# print(summery)



# x = 5
# y = 5
# z = x * y

# print(z)
# УМНОЖЕНИЕ БУДЕТ ТИПА INTEGER



# x = 5
# y = 5
# z = x / y
# print(z)
# ДЕЛЕНИЕ БУДЕТ ТИПА FLOAT



# НА НОЛЬ ДЕЛИТЬ НЕЛЬЗЯ . ВЫДАЕТ ОШИБКУ



# ** возведение в степень 
# // целочисленное деление 
# % остаток от деления

# ВОЗВЕДЕНИЕ В СТЕПЕНЬ 3
# x = 3 
# print(x ** 3)


# ЦЕЛОЧИСЛЕННОЕ ДЕЛЕНИЕ
# x = 9
# y = 4

# print(x // y)


#ОСТАТОК ОТ ДЕЛЕНИЯ
# x = 9
# y = 4

# print(x % y)



# При 0 < n < m результатом деления n % m является число n, а результатом деления n // m является число 0.

# print(5 % 9)
# print(3 % 13)
# print(5 // 9)
# print(3 // 13)

# 5
# 3
# 0
# 0



# Целочисленное деление всегда округляется в меньшую сторону



# print(13 // 12, 9 // 12, 9 % 12, 84// 12, 18 % 12)


# print(84 / 12)


# У унарного минуса приоритет меньше чем у возведения в степень**
# print((-10)**2) = 100 . Почему? Потому что это выглядит как (-10) * (-10) = 100
# print((-10)**3) = -1000 . Почему? Потому что это выглядит как (-10) * (-10) = 100 * (-10) = -1000



# print(3**1**2)



# print(23 % 7) 

# print(20 % 5)  

# print(2 % 5)  

# print(123 % 10)  

# print(-123 // 10)



# При помощи операторов целочисленного деления // и нахождения остатка % от целочисленного деления, можно найти любую цыфру из числа 

# программа получения цыфр двузначного числа 

# num = 17
# a = num % 10 # вычисляем последнюю цыфру
# b = num // 10 # вычисляем первую цыфру

# print(a, b,)

# программа вычисления цыфр трехзначного числа

# num = 754
# a = num % 10 # вычисляем последнюю цыфру
# b = (num % 100) // 10 # вычисляем среднюю цыфру
# c = num // 100 # вычисляем первую цыфру

# print(a, b, c)




# Несложно понять, по какому алгоритму можно получить каждую цифру n-значного числа num:

# Последняя цифра: num % 10
# Предпоследняя цифра: (num // 10) % 10
# Предпредпоследняя цифра: (num // 100) % 10
# ...
# Третья цифра: (num // 10 ** (n - 3)) % 10
# Вторая цифра: (num // 10 ** (n - 2)) % 10
# Первая цифра: num // 10 ** (n - 1)

# Запишем формулу для вычисления i-й цифры n-значного числа num в общем виде:
# (num // 10 ** (n - i)) % 10


# Также предложим другой алгоритм получения каждой цифры n-значного числа num:

# Последняя цифра: num % 10
# Предпоследняя цифра: (num % 100) // 10
# Предпредпоследняя цифра: (num % 1000) // 100
# ...
# Третья цифра: (num % 10 ** (n - 2)) // (10 ** (n - 3))
# Вторая цифра: (num % 10 ** (n - 1)) // (10 ** (n - 2))
# Первая цифра: (num % 10 ** n) // (10 ** (n - 1))

# Мы можем записать формулу для вычисления i-й цифры n-значного числа num в общем виде:
# num % 10 ** (n + 1 - i) // (10 ** (n - i))



# Напишите программу, которая печатает число, образованное при перестановке цифр двузначного числа.

# num = int(input())
# last_digit = num % 10
# first_digit = num // 10

# print('Искомое число =', last_digit * 10 + first_digit)



# Напишите программу, в которую вводится трехзначное число и которая выводит на экран его цифры (через запятую).

# num = int(input())
# digit3 = num % 10
# digit2 = (num // 10) % 10
# digit1 = num // 100

# print(digit1, digit2, digit3, sep = ',')



# integer можно складывать с float. в таком случае мы получим число типа float
# my_integer = 10
# my_float = 5.5

# print(my_integer + my_float)


# int не округляет , а просто отрезает все что после точки
# my_float = 1.9999
# my_integer = int(my_float)

# print(my_integer)


#что бы округлить используем функцию round
# my_float = 1.9999
# my_integer = round(my_float)

# print(my_integer)



# ТИП BOOL
# ВКЛЮЧАЕТ В СЕБЯ 2 ЗНАЧЕНИЯ True или False
# is_student = True
# is_graduated = False

# print(is_graduated)



# результатом будет переменная типа bool(True или False)
# оператор сравнения/равенства ==
# x = 10
# y = 10
# print(x == y)



# оператор сравнения/равенства ==
# оператор не равенства !=
# больше >
# меньше <
# больше либо равно >=
# меньшк либо равно <=



# x = 10
# y = 9
# print(x > y) # True
# print(x < y) # False
# print(x == y) # False
# print(x >= y) # True
# print(x <= y) # False


# x = 10
# y = 10

# print(x >= y) # True
# print(x <= y) # True


# для проверки двух условий используем операторы and и or

# x = 6
# print(x < 5 and x > -2)

# оператор not меняет знак у переменной типа bool
# is_student = True
# print(not is_student)



