# РАССМОТРИМ КОД ЧТО НАПИШЕТ ПРИВЕТ 10 РАЗ

# for i in range(10):
#     print('Hello')

# ДВОЕТОЧИЕ НУЖНО ЧТО БЫ ИНТЕРПРЕТАТОР ПОНЯЛ ЧТО ДАЛЬШЕ ИДЕТ БЛОК КОМАНД 
# В БЛОК ОКМАНД ВХОДЯТ ВСЕ СТРОКИ С ОТСТУПОМ ПОСЛЕ ИНСТРУКЦИИ for
# БЛОК КОМАНД КОТОРЫЙ ВЫПОЛНЯЕТСЯ В ЦИКЛЕ for НАЗЫВАЕТСЯ ТЕЛОМ ЦИКЛА 

# РАНЬШЕ МЫ СЧИТЫВАЛИ ЧЕРЕЗ input() 
# А С ПОМОЩЬЮ for МОЖНО СЧИТЫВАТЬ СКОЛЬКО УГОДНО ЧИСЕЛ

# for i in range(5):
#     num = int(input())
#     print('Квадрат вашего числа равен:', num * num)

# print('Цикл завершен')

#                                                      ФУНКЦИЯ RANGE() С ОДНИМ ПАРАМЕТРОМ
# for i in range(10):
#     print('Hello', i)
# ЗНАЧЕНИЕ В СКОБКАХ range ОБОЗНАЧАЕТ КОЛИЧЕСТВО ИТЕРАЦИЙ ЦИКЛА ПРИ ЭТОМ i ПРИНИМАЕТ ЗНАЧЕНИЕ ОТ 0 ДО 9 
# Если быть более точным функция range(stop) генерирует последовательность чисел от 0 до stop - 1
# а цикл for последовательно перебирает эту последовательность


#                                                      ПЕРЕГРУЗКА RANGE() С ДВУМЯ ПАРАМЕТРАМИ 

# ЕСЛИ НУЖНО НАЧАТЬ ПОСЛЕДОВАТЕЛЬНОСТЬ НЕ С 0 А С ЛЮБОГО ДРУГОГО ЧИСЛА ТО МЫ ИСПОЛЬЗУЕМ ПЕРЕГРУЗКУ ФУНКЦИИ ПРИНИМАЮЩУЮ 2 ПАРАМЕТРА 
# НАПРИМЕР ВЫЗОВ ФУНКЦИИ range(1, 5) СГЕНЕРИРУЕТ ЧИСЛА ОТ 1 ДО 4(ПРАВАЯ ГРАНИЦА НЕ ВКЛЮЧИТЕЛЬНА) 
# ТАКИМ ОБРАЗОМ range(stop): 
# создает последовательность чисел 0, 1, 2, 3, ..., stop - 1;
# range(start, stop): создает последовательность чисел start, start + 1, start + 2, ..., stop - 2, stop - 1.  
# НАПИШЕМ ПРОГРАММУ ЧТО ВЫВОДИТ ЧИСЛА В ПРОМЕЖУТКЕ 100 999 ОКАНЧИВАЮЩИЕСЯ НА 7

# for i in range(100, 1000): # ПЕРЕБИРАЕМ ЧИСАЛ ОТ 100 ДО 999
#      if i % 10 == 7:       # ИСПОЛЬЗУЕМ ОСТАТОК ОТ ДЕЛЕНИЯ ДЛЯ НАХОЖДЕНИЯ ПОСЛЕДНЕЙ ЦИФРЫ 
#         print(i)


#                                                      ПЕРЕГРУЗКА RANGE() С ТРЕМЯ ПАРАМЕТРАМИ 
# ПЕРЕДАВАЯ ДВА ПАРАМЕТРА В ФУНКЦИЮ МЫ МОЖЕМ СГЕНЕРИРОВАТЬ ПОСЛЕДОВАЕТЛЬНОСТЬ ЧИСЕЛ С ШАГОМ 1
# ЧТО БЫ СДЕЛАТЬ ШАГ БОЛЬШЕ ИСПОЛЬЗУЕМ ФУНКЦИЮ ПРИНИМАЮЩУЮ 3 ПАРАМЕТРА :
# range(start, stop, step) (СТАРТ ПОСЛЕДОВАТЕЛЬНОСТИ, СТОП ПОСЕЛДОВАТЕЛЬНОСТИ, ШАГ ГЕНЕРАЦИИ ЧИСЕЛ)
# ВЫЗОВ ФУНКЦИИ range(5, 30, 5) ВЫВЕДЕТ 5, 10, 15, 20, 25
#НАПИШЕМ ПРОГРАММУ ЧТО ВЫВОДИТ ЧЕТНЫЕ ЧИСЛА В ПРОМЕЖУТКЕ 56 170

# for i in range(56, 170, 2):
#     print(i) 
# МОЖНО ИСПОЛЬЗОВАТЬ ФУНКЦИЮ И С ДВУМЯ ПАРАМЕТРАМИ 

# for i in range(56, 171):
#     if i % 2 == 0:
#         print(i)
# МЕНЕЕ ЭФФЕКТИВНО


#                                                      ОТРИЦАТЕЛЬНЫЙ ШАГ ГЕНЕРАЦИИ
# ЕСЛИ ШАГ ГЕНЕРАЦИИ ПОЛОЖИТЕЛЬНЫЙ ТО И ПОСЛЕДОВАТЕЛЬНОСТЬ БУДЕТ ТАКОЙ ЖЕ
# МОЖНО УКАЗАТЬ ОТРИЦАТЕЛЬНЫЙ ЗНАК И ТОГДА ПОСЛЕДОВАТЕЛЬНОСТЬ СТАНЕТ ТАКОЙ ЖЕ
# В СЛУЧАЕ ОТРИЦАТЕЛЬНОЙ ПОСЛЕДОВАТЕЛЬНОСТИ МЫ ДОЛЖНЫ ГАРАНТИРОВАТЬ ЧТО СТАРТ БОЛЬШЕ ЧЕМ КОНЕЦ
# ВЫЗОВ ФУНКЦИИ range(20, 16, -1) ВЫВЕДЕТ ПОСЛЕДОВАТЕЛЬНОСТЬ 20, 19, 18, 17 
# НАПИШЕМ ПРОГРАММУ ЧТО ОТСЧИТЫВАЕТ ОТ 5 ДО 1 А ЗАТЕМ ВЫВОДИТ ТЕКСТ 
# for i in range(5, 0, -1):
#     print(i, end= ' ')
# print('Roll Out')

# ЕСЛИ ВЕЛИЧИЧНА ШАГА ОТРИЦАТЕЛЬНА И ПЕРВЫЙ ПАРАМЕТР МЕНЬШЕ ВТОРОГО ТО ФУНКЦИЯ range() ГЕНЕРИРУЕТ ПУСТУЮ ПОСЛЕДОВАТЕЛЬНОСТЬ 





#                                                        ПОДСЧЕТ КОЛИЧЕСТВА Сумматор: 
# Сумматор: total = 0 
# Мультипликатор: total = 1

# ПРОГРАММА ЧТО СЧИТЫВАЕТ 10 ЧИСЕЛ И ОПРЕДЕЛЯЕТ СКОЛЬКО ИЗ НИХ БОЛЬШЕ 10

# counter = 0
# for _ in range(10):
#     num = int(input())
#     if num > 10:
#         counter = counter + 1

# print('Было введено', counter, 'чисел, больших 10.')

# КАЖДЫЙ РАЗ КАК ПРОГРАММА СЧИТЫВАЕТ ЧИСЛО БОЛЬШЕ 10 ОНО ПРИБАВЛЯЕТ В counter ЧИСЛО 1 


# Подсчет количества – это очень частый сценарий. Он состоит из двух шагов:
# Создание переменной счетчика, и придание ей первоначального значения: counter = 0;
# Увеличение переменной счетчика на 1: counter = counter + 1 
# ЧАСТО ПРИ НАПИСАНИИ ПРОГРАММ НУЖНО НЕСКОЛЬКО СЧЕТЧИКОВ 

# counter1 = 0
# counter2 = 0
# for _ in range(10):
#     num = int(input())
#     if num > 10:
#         counter1 = counter1 + 1
#     if num == 0:
#         counter2 = counter2 + 1
# print('Было введено', counter1, 'чисел, больших 10.')
# print('Было введено', counter2, 'нулей.' )


# РАССМОТРИМ ПРОГРАММУ КОТОРАЯ ПОДСЧИТЫВАЕТ КОЛИЧЕСТВО ЧИСЕЛ ИЗ ДИАПОЗОНА 1 100 КВАДРАТ КОТОРЫХ ЗАКАНЧИВАЕТСЯ НА 4
 
# counter = 0
# for i in range(1, 101):
#     if i ** 2 % 10 == 4:
#         counter = counter + 1
# print(counter)




#                                                        ВЫЧИСЛЕНИЕ СУММЫ И ПРОИЗВЕДЕНИЯ

# НАПИШЕМ ПРОГРАММУ ЧТО СЧИТЫВАЕТ 10 ЧИСЕЛ И СЧИТВЕТ СУММУ ТЕХ ЧТО БОЛЬШЕ 10
# total = 0
# for _ in range(10):
#     num = int(input())
#     if num > 10:
#         total = total + num
# print('Сумма чисел больших 10 равна',  total)

# КАЖДЫЙ РАЗ КАК ПРОГРАММА СЧИТЫВАЕТ ЧИСЛО БОЛЬШЕ 10 ОНО ПРИБАВЛЯЕТ В total ЧИСЛО num
# Создание переменной сумматора, и придание ей первоначального значения: total = 0;
# Увеличение переменной сумматора на нужное число: total = total + num 
# ПРОГРАММА ЧТО СЧИТАЕТ СУММУ НАТУР. ЧИСЕЛ ОТ 1 ДО 100

# total = 0
# for i in range(1, 101):
#     total = total + 1
# print('Сумма равна', total) 


# НАПИШЕМ ПРОГРАММУ ЧТО ЗАПРАШИВАЕТ 10 ЧИСЕЛ И СЧИТАЕТ ИХ СРЕДНЕЕ ЗНАЧЕНИЕ 

# total = 0 
# for _ in range(10):
#     num = int(input())
#     total = total + num
# average = total / 10
# print('Среднее значение равно', average) 

# При вычислении произведения начальное значение переменной мультипликатора мы устанавливаем равным 1
# в отличие от сумматора, где оно равно 0





#                                                        ОБМЕН ЗНАЧЕНИЙ ПЕРЕМЕННЫХ
# ДЛЯ ОБМЕНА ДАННЫХ ПЕРЕМЕННЫХ МОЖНО ИСПОЛЬЗОВАТЬ ПРЕВЕННУЮ ПЕРЕМЕННУЮ
# temp = x
# x = y
# y = x 
# НО ЕСТЬ БОЛЕЕ ПРОСТОЙ СПОСОБ 
# x, y = y, x





#                                                        СИГНАЛЬНЫЕ МЕТКИ 
# СИГНАЛЬНАЯ МЕТКА МОЖЕТ БЫТЬ ИСПОЛЬЗОВАННА ДЛЯ ТОГО ЧТО БЫ ОДНА ЧАСТЬ ПРОГРАММЫ ПОНЯЛА ЧТО ПРОИСХОДИТ В ДРУГОЙ ЧАСТИ ПРОГРАММЫ 
# НАПИШЕМ ПРОГРАММУ ЧТО ОПЕРЕДЛЯЕТ ЯВЛЯЕТСЯ ЛИ НАТУРАЛЬНОРЕ ЧИСЛО ПРОСТЫМ

# num = int(input())
# flag = True

# for i in range(2, num):
#     if num % i == 0: #  если исходное число делится на какое-либо отличное от 1 и самого себя
#         flag = False

# if num == 1:
#     print('Это единица, она не простая и не составная')      
# elif flag == True:
#     print('Число простое')
# else:
#     print('Число составное')





#                                                        МАКСИМУМ И МИНИМУМ 
# ПРОГРАММА ЧТО ИЗ 10 ПОЛОЖИТЕЛЬНЫХ ЧИСЕЛ НАХОДИТ НАИБОЛЬШЕЕ

# largest = 0
# for _ in range(10):
#     num = int(input())
#     if num > largest:
#         largest = num
# print('Наибольшее число равно', largest)


# ПРОГРАММА ЧТО ИЗ 10 ЧИСЕЛ(НЕОБЯЗАТЕЛЬНО ПОЛОЖИТЕЛЬНЫХ) НАХОДИТ НАИБОЛЬШЕЕ

# largest = int(input()) # принимаем первое число за максимальное
# for _ in range(10):
#     num = int(input())
#     if num > largest:
#         largest = num
# print('Наибольшее число равно', largest) 
# Для нахождения наименьшего значения последовательности следует поменять знак неравенства (>) на противоположный (<). 
# В таком случае название переменной largest стоит заменить на smallest.





#                                                        РАСШИРЕННЫЕ ОПЕРАТОРЫ ПРИСВАИВАНИЯ 
# ДЛЯ УДОБСТВА СУЩЕСТВУЮТ РАСШИРЕННЫЕ ОПЕРАТОРЫ ПРИСВАИВАНИЯ НАПРИМЕР:
# total = total + num 
# МОЖНО ЗАПИСАТЬ КАК 
# total += num 





#                                                        ОПЕРАТОР ПРЕРЫВВАНИЯ ЦИКЛА break 
# УСОВЕРШЕНСТВУЕМ С ПОМОЩЬЮ ЭТОГО ОПЕРАТОРА ПРОГРАММУ ПРОВЕРЯЮЩУЮ ЧИСЛО НА ПРОСТОТУ

# num = int(input())
# flag = True

# for i in range(2, num):
#     if num % i == 0:  # если исходное число делится на какое-либо отличное от 1 и самого себя
#         flag = False
#         break         # останавливаем цикл если встретили делитель числа       

# if flag:              # эквивалентно if flag == True:
#     print('Число простое')
# else:
#     print('Число составное')


# Как только мы встречаем делитель отличный от 1 и num, мы меняем значение сигнальной метки и прерываем цикл
# поскольку дальнейшее его выполнение лишено смысла: число гарантированно не является простым.
# Оператор прерывания цикла break позволяет ускорять программы, так как мы избавляемся от лишних итераций.


# НАПИШЕМ ПРОГРАММУ, ИСПОЛЬЗУЮЩУЮ ЦИКЛ FOR, КОТОРАЯ СЧИТЫВАЕТ 10 ЧИСЕЛ И СУММИРУЕТ ИХ ДО ТЕХ ПОР, ПОКА НЕ ОБНАРУЖИТ ОТРИЦАТЕЛЬНОЕ ЧИСЛО.
# В ЭТОМ СЛУЧАЕ ВЫПОЛНЕНИЕ ЦИКЛА ПРЕРЫВАЕТСЯ КОМАНДОЙ BREAK:

# result = 0

# for i in range(10):
#     num = int(input())
#     if num < 0:
#         break
#     result += num
# print(result)



# ПРОГРАММА ЧТО ОПРЕДЕЛЯЕТ ЕСТЬ ЛИ В ЧИЛЕ ЦИФРА 7
 
# num = int(input())
# number = num 
# flag = False

# while num != 0:
#     last_digit = num % 10
#     if last_digit == 7:
#         flag = True
#         break # ПРЕРЫВАЕМ ЦИКЛ ТАК КАК В НЕМ ГАРАНТИРОВАННО ЕСТЬ ЦИФРА 7
#     num //= 10

# if flag:  # эквивалентно if flag == True:
#     print('Число', number, 'содержит цифру 7')
# else:
#     print('Число', number, 'не содержит цифру 7')
 
# КАК ТОЛЬКО МЫ ВСТРЕЧАЕМ 7 МЫ ПРЕРЫВАЕМ РАБОТУ ОПЕРАТОРОМ break. 
# МОЖНО И НЕ ПРЕРЫВАТЬ, А ДОЖДАТЬСЯ ЕГО ЕСТЕСТВЕННОГО ЗАВЕРШЕНИЯ(УСЛОВИЕ NUM != 0ТО ЕСЬТ ВСЕ ЦИФРЫ ЧИСЛА ОБРАБОТАНЫ) ОДНАКО В ТАКОМ СЛУЧАЕ ПРОГРАММА СОВЕРШАЕТ ЛИШНЮЮ РАБОТУ   





#                                                              ОПЕРАТОР continue
# ЭТОТ ОПЕРАТОР ПОЗВОЛЯЕТ ПЕРЕЙТИ С СЛЕДУЮЩЕЙ ИТЕРАЦИИ ЦИКЛА for ИЛИ while ЛО ЗАВЕРШЕНИЯ ВСЕХ КОМАНД В ТЕЛЕ ЦИКЛА

# НАПИШЕМ ПРОГРАММУ КОТОРАЯ ВЫВОДИ ВСЕ ЧИСЛА ОТ 1 ДО 100 КРОМЕ ЧИСЕЛ 7 17 29 78
# for i in range(1, 101):
#     if i == 7 or i == 17 or i == 29 or i == 78:
#         continue # ПЕРЕХОДИМ НА СЛЕДУБЩУБ ОПЕРАЦИЮ
#     print(i)

# i = 100
# while i > 0:
#     if i == 40:
#         break
#     print(i, end='*')
#     i -= 20

# n = 10
# while n > 0:
#     n -= 1
#     if n == 2:
#         continue
#     print(n, end='*')





#                                                            ВЛОЖЕННЫЕ ЦИКЛЫ
# ОТЛИЧНЫЙ ПРИМЕР ВЛОЖЕННОГО ЦИКЛА ЭТО ЧАСЫ ЧАСОВАЯ СТРЕЛКА СМЕЩАЕТСЯ ВСЕГО НА 1 ШАГ ДЛЯ КАЖДЫХ 60 ШАГОВ МИНУТНОЙ СТРЕЛКИ. 
# И СЕКУНДНАЯ СТРЕЛКА ДОЛЖНА СДЕЛАТЬ 60 ШАГОВ ДЛЯ 1 ШАГА МИНУТНОЙ СТРЕЛКИ. 
# ЭТО ОЗНАЧАЕТ, ЧТО ДЛЯ КАЖДОГО ПОЛНОГО ОБОРОТА ЧАСОВОЙ СТРЕЛКИ (12 ШАГОВ), МИНУТНАЯ СТРЕЛКА ДЕЛАЕТ 720 ШАГОВ.

# РАССМОТРИМ ЦИКЛ ЧТО ЧАСТИЧНО МОДЕЛИРУЕТ РАБОТУ Э ЧАСОВ

# for seconds in range(60):
#     print(seconds)
# МОЖНО ДОБАВИТЬ МИНУТНУЮ ПЕРЕМЕННУЮ И ВЛОЖИТЬ ЦИКЛ НАПИСАННЫЙ ВЫШЕ В ЕЩЕ ОДИН ЦИКЛ КОТОРЫЙ ПОВТОРЯЕТСЯ 60 РАЗ

# for minutes in range(60):
#     for seconds in range(60):
#         print(minutes, ':', seconds)

# ДЛЯ ТОГО ЧТО БЫ ЗАКОНЧИТЬ МОЖНО ДОБАВИТЬ ЕЩЕ ОДНУ ПЕРЕМЕННУЮ ЧАСОВ

# for hours in range(24):
#     for minutes in range(60):
#         for seconds in range(60):
#             print(hours, ':', minutes, ':', seconds)

# Пример имитационной модели часов подводит нас к нескольким моментам, имеющим отношение к вложенным циклам:

# вложенный цикл выполняет все свои итерации для каждой отдельной итерации внешнего цикла;
# вложенные циклы завершают свои итерации быстрее, чем внешние циклы;
# для того, чтобы получить общее количество итераций вложенного цикла, надо перемножить количество итераций всех циклов.
# Мы можем вкладывать друг в друга циклы как for, так и while.





#                                                          ОПЕРАТОРЫ break И continue ВО ВЛОЖЕННЫХ ЦИКЛАХ  
# ОПЕРАТОР break ВЫПОЛНЯЕТ ПРЕРЫВАНИЕ БЛИЖАЙШЕГО ЦИКЛА В КОТОРОМ ОН РАСПОЛОЖЕН 
# АНАЛОГИЧНО ОПЕРАТОР continue ОСУЩЕСТВЛЯЕТ ПЕРЕХОД НА СЛЕДУЮЩУЮ ИТЕРАЦИЮ БОИЖАЙШЕГО ЦИКЛА 
# РАССМОТРИМ ПРОГРАММНЫЙ КОД 

# for i in range(3):
#     for j in range(3):
#         print(i, j)

# РЕЗУЛЬТАТОМ ЕГО ВЫПОЛНЕНИЯ БУДУТ 9 СТРОК 
# 0 0 
# 0 1
# 0 2 
# 1 0 
# 1 1 
# 1 2 
# 2 0 
# 2 1 
# 2 2 


# ИЗМЕНИМ КОД ДОБАВИВ ВО ВЛОЖЕННЫЙ ЦИКЛ УСЛОВНЫЙ ОПЕРАТОР С ОПЕРАТОРОМ break

# for i in range(3):
#     for j in range(3):
#         if i == j:
#             break
#         print(i, j)

# РЕЗУЛЬТАТОМ ЕГО ВЫПОЛНЕНИЯ БУДУТ 3 СТРОКИ

# 1 0 
# 2 0
# 2 1


# ИЗМЕНИМ ОПЕРАТОР ПРЕРЫВАНИЯ break НА continue

# for i in range(3):
#     for j in range(3):
#         if i == j:
#             continue
#         print(i, j)

# РЕЗУЛЬТАТОМ ЕГО ВЫПОЛНЕНИЯ БУДУТ 6 СТРОК

# 0 1
# 0 2
# 1 0
# 1 2
# 2 0
# 2 1

# ЕСЛИ НЕОБХОДИМО ДОБИТЬСЯ ПРЕРЫВАНИЯ ВНЕШНЕГО ЦИКЛА ИЗЗА ВЫПОЛНЕНИЯ УСЛОВИЯ ВО ВНУТРЕННЕМ ТО СТОИТ ДЛЯ ЭТОГО ИСПОЛЬЗОВАТЬ ФЛАЖЕК

# ИНТЕРЕСНЫЙ СПОСОБ УЗНАТЬ О РАБОТЕ ВЛОЖЕННЫХ ЦИКЛОВ СОСТОИТ В ЭТОЙ ЗАДАЧЕ 
# НАПИШИТЕ ПРОГРАММУ ЧТО ВЫВОДИТ ПРЯМОУГОЛЬНУЮ ТАБЛИЦУ  ИЗ *  
# СЛЕДУЮЩИЙ КОД ПРИМЕНЯЕТЬСЯ ДЛЯ ВІВОДА ТОЛЬКО ОДНОЙ СТРОКИ *

# for i in range(6):
#     print('*', end='')

# ДЛЯ ТОГО ЧТО БЫ ЗАВЕРШИТЬ ВЫВОД ТАБЛИЦЫ ИЗ ЗВЕЗД НУЖНО ВЫПОЛНИТЬ ЭТОТ ЦИКЛ 8 РАЗ 
# ДЛЯ ЭТОГО ПЕРЕМЕСТИМ КОД ВЫШЕ В ЦИКЛ КОТОРЫЙ 8 РАЗ ДЕЛАЕТ ИТЕРАЦИЮ КАК ПОКАЗАНО НИЖЕ

# for i in range(8):
#     for j in range(6):
#         print('*', end='')
#     print()   

# ВНЕШНИЙ ЦИКЛ ДЕЛАЕТ 8 ИТЕРАЦИЙ. ВО ВРЕМЯ КАЖДОЙ ИЗ НИХ ВНУТРЕННИЙ ЦИКЛ ДЕЛАЕТ 6 ИТЕРАЦИЙ 
# ТАК ЖЕ В КОНЦЕ ОБЯЗАТЕЛЬНО ДОБАВЛЯЕМ print() ЭТО НУЖНО ЧТО БЫ В КОНЦЕ КАЖДОЙ СТРОКИ ЭКРАННЫЙ КУРСОР ПРОДВИНУЛСЯ НА СЛЕДУЮЩУЮ СТРОКУ 
# БЕЗ ЭТОГО ПРИНТА ЗВЕЗДЫ ВЫВЕДУТСЯ В ОДНУ СТРОКУ 

# А ВОТ ПРОГРАММА КАК ВЫВЕСТИ ТРЕУГОЛЬНИК  ИЗ ТЕХ ЖЕ ЗВЕЗД 
# ДЛЯ ЕЕ РЕШЕНИЯ ПРЕДСТАВИМ ЭТИ ЗВЕЗДЫ КАК КОМБИНАЦИЮ СТРОК И СТОЛБЦОВ 
# В ПЕРВОЙ СТРОКЕ - 1 СТОЛБЕЦ , ВО ВТОРОЙ - 2 СТОЛБЦА И ТАК ДАЛЕЕ 

# for i in range(8):
#     for j in range(i + 1):
#         print('*', end = '')
#     print()





# for i in range(1, 4):
#     for j in range(3, 6):
#         print(i, j)





# for i in range(1, 4):
#     for j in range(3, 5):
#         print(i + j, end='')





# counter = 0
# for i in range(99, 102):
#     temp = i
#     while temp > 0:
#         counter += 1
#         temp //= 10

# print(counter)




