# РАССМОТРИМ КОД ЧТО НАПИШЕТ ПРИВЕТ 10 РАЗ

# for i in range(10):
#     print('Hello')

# ДВОЕТОЧИЕ НУЖНО ЧТО БЫ ИНТЕРПРЕТАТОР ПОНЯЛ ЧТО ДАЛЬШЕ ИДЕТ БЛОК КОМАНД 
# В БЛОК ОКМАНД ВХОДЯТ ВСЕ СТРОКИ С ОТСТУПОМ ПОСЛЕ ИНСТРУКЦИИ for
# БЛОК КОМАНД КОТОРЫЙ ВЫПОЛНЯЕТСЯ В ЦИКЛЕ for НАЗЫВАЕТСЯ ТЕЛОМ ЦИКЛА 

# РАНЬШЕ МЫ СЧИТЫВАЛИ ЧЕРЕЗ input() 
# А С ПОМОЩЬЮ for МОЖНО СЧИТЫВАТЬ СКОЛЬКО УГОДНО ЧИСЕЛ

# for i in range(5):
#     num = int(input())
#     print('Квадрат вашего числа равен:', num * num)

# print('Цикл завершен')

# 














































