# for - counting loops
# while - conditional loops
# НЕ ПОВТОРЕНИЕ А ИТЕРАЦИЯ!!!!!!!!!!!!!!!

# ЧТО БЫ ЦИКЛ ВЫПОЛНЯЛСЯ ДО ОПРЕДЕЛЕННОГО СОБЫТИЯ ИСПОЛЬЗУЕМ ЦИКЛ while 
# ЕГО СТРУКТУРА ВЫГЛЯДИТ ТАК

# while условие:
    #блок кода
# ДВОЕТОЧИЕ НУЖНО ЧТО БЫ ИНТЕРПРЕТАТОР ПОНЯЛ ЧТО ДАЛЬШЕ ИДЕТ БЛОК КОМАНД 
# В БЛОК КОМАНД ВХОДЯТ ВСЕ СТРОКИ С ОТСТУПОМ ПОСЛЕ ИНСТРУКЦИИ while 
# БЛОК КОМАНД КОТОРЫЙ ВЫПОЛНЯЕТСЯ В ЦИКЛЕ while НАЗЫВАЕТСЯ ТЕЛОМ ЦИКЛА 

# КОД ЧТО 10 РАЗ РАСПЕЧАТАЕТ СЛОВО ПРИВЕТ

# i = 0

# while i <  10:
#     print('HELLO')
#     i += 1     
# ПОДОБНЫЙ КОД МОЖНО ЛЕГКО ЗАМЕНИТЬ ЦИКЛОМ for ТАК КАК МЫ ЗНАЕМ СКОЛЬКО РАЗ НУЖНО ВЫПОЛНИТЬ ТЕЛО ЦИКЛА 
# НАПИШЕМ ПРОГРАММУ ЧТО СЧИТЫВАЕТ ЧИСЛА И ВЫВОДИТ ИХ КВАДРАТЫ ПОКА НЕ БУДЕТ ВВЕДЕНО -1 
# В ТАКОМ СЛУЧАЕ МЫ НЕ СМОЖЕМ ИСПОЛЬЗОВАТЬ for ТАК КАК МЫ НЕ ЗНАЕМ СКОЛЬКО ЦИФР БУДЕТ ДО -1

# num = int(input())

# while num != -1:
#     print(num * num)
#     num = int(input()) 
# В КАЧЕСТВЕ НАЧАЛЬНОГО ЗНАЧЕНИЯ ПЕРЕМЕННОЙ num ИСПОЛЬЗЕМ ПЕРВОЕ ИЗ ЧИСЕЛ 
# ДАЛЕЕ ПОКА ВВЕДЕННОЕ ЧИСЛО НЕ РАВНО -1 ВЫПОЛНЯЕТСЯ БЛОК КОДА 
# В НЕГО ВХОДИТ ДВЕ КОМАНДЫ: 
# 1 НАПЕЧАТАТЬ КВАДРАТ ЧИСЛА 
# 2 СПРОСИТЬ НОВОЕ ЧИСЛО 
# ВАЖНЫЕ МОМЕНТЫ 
# 1 ПРАВИЛЬНАЯ ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННОЙ num 
# 2 ИЗМЕНЕНИЕ ПЕРЕМЕННОЙ num ВНУТРИ ЦИКЛА 



# ВСЕГДА МОЖНО ЗАМЕНИТЬ ЦИКЛ for НА ЦИКЛ while РАСМОТРИМ ДВА ВАРИАНТА 
# for i in range(101):
#     print(i)

# i = 0 
# while i < 101:
#     print(i)
#     i += 1  В ПЕРВОМ ВАРИАНТЕ 

# В ПЕРВОМ ЦИКЛЕ ПЕРЕМЕННАЯ i ПОСЛЕДОВАТЕЛЬНО ПРИНИМАЕТ ЗНАЧЕНИЯ ОТ 0 ДО 100.
# ДЛЯ ЦИКЛА while НАМ ПРИШЛОСЬ ЗАВЕСТИ САМОСТОЯТЕЛЬНО ПЕРЕМЕННУЮ i И ПРИДАТЬ ЕЙ НАЧАЛЬНОЕ ЗНАЧЕНИЕ.
# ТЕЛО ЦИКЛА while СОДЕРЖИТ АНАЛОГИЧНУЮ ИНСТРУКЦИЮ ВЫВОДА print(i), 
# ОДНАКО ПОМИМО ЭТОГО МЫ САМОСТОЯТЕЛЬНО УВЕЛИЧИВАЕМ ЗНАЧЕНИЕ ПЕРЕМЕННОЙ i НА 1,
# ЧТО ДЕЛАЕТСЯ АВТОМАТИЧЕСКИ В СЛУЧАЕ С ЦИКЛОМ for.

# НАПИШЕМ ПРОГРАММУ, ВЫВОДЯЩУЮ ВСЕ ЧИСЛА, КРАТНЫЕ 3, ИСПОЛЬЗУЯ ЦИКЛ for И while:

# for i in range(0, 100, 3):
#     print(i)

# i = 0
# while i < 100:
#     print(i)
#     i += 3 

# ЕСОИ ЗАРАНЕЕ НЕ ИЗВЕСТНО КОЛИЧЕСТВО ИТЕРАЦИЙ МЫ ИСРОЛЬЗУЕМ ЦИКЛ while





#                                                         СЧИТЫВАНИЕ ДАННЫХ ДО СТОП ЗНАЧЕНИЯ

# ЧАСТО ПРИ РЕШЕНИИ ЗАДАЧ НА ЦИКЛ while СЧИТЫВАЕМ ДАННЫЕ ДО ТЕХ ПОР, ПОКА ПОЛЬЗОВАТЕЛЬ НЕ ВВЕДЕТ НЕКОТОРОЕ ЗНАЧЕНИЕ, 
# КОТОРОЕ НАЗЫВАЮТ СТОП ЗНАЧЕНИЕМ. 
# НАПИШЕМ ПРОГРАММУ, КОТОРАЯ СЧИТЫВАЕТ ЧИСЛА И НАХОДИТ ИХ СУММУ ДО ТЕХ ПОР, ПОКА ПОЛЬЗОВАТЕЛЬ НЕ ВВЕДЕТ СЛОВО stop.

# text = input()
# total = 0
# while text != 'stop':
#     total += int(text)
#     text = input()

# print('Сумма чисел равна', total)

# i = 7
# a = 5
# while i < 11:
#     a += i
#     i += 2

# print(a)





#                                                         ОБРАБОТКА ЦИФР ЧИСЛА 
# ИСПОЛЬЗУЯ while И ОПЕРАЦИИ % И // МЫ СМОЖЕМ ЗНАТЬ ЦИФРЫ ЧИСЛА С ПРОИЗВОЛЬНЫМ КОЛИЧЕСТВОМ РАЗРЯДОВ(ЦИФР) 
# Пусть дано натуральное число n. Тогда:
# результатом операции n % 10 – является последняя цифра числа;
# результатом операции n // 10 – является число с удаленной последней цифрой.
# Напишем программу, которая считывает натуральное число (целое положительное) и обрабатывает его цифры.

# n = int(input())

# while n != 0: # ПОКА В ЧИСЛЕ ЕСТЬ ЦИФРЫ
#     last_digit = n % 10 # ПОЛУЧИТЬ ПОСЛЕДНЮЮ ЦИФРУ 
#     # КОД ОБРАБОТКИ ПОСЛЕДНЕЙ ЦИФРЫ
#     n = n // 10 # УДАЛИТЬ ПОСЛЕДНЮЮ ЦИФРУ ИЗ ЧИСЛА

# Цикл while работает до тех пор, пока в числе есть необработанные цифры. Тело цикла содержит:
# 1. процедуру получения последней цифры last_digit = n % 10;
# 2. код обработки последней цифры;
# 3. процедуру удаления последней цифры из числа n = n // 10.


# НАПИШЕМ ПРОГРАММУ ЧТО ОПРЕДЕЛЯЕТ ЕСТЬ ЛИ В ЧИСЛЕ ЦИФРА 7

# num = int(input())
# has_seven = False # СИГНАЛЬНАЯ МЕТКА!

# while num != 0:
#     last_digit = num % 10
#     if last_digit == 7:
#         has_seven = True
#     num = num // 10

# if has_seven == True:
#     print('YES')
# else:
#     print('NO')





#                                                         БЕСКОНЕЧНЫЕ ЦИКЛЫ
# САМЫЙ ПРОСТОЙ СПОСОБ СОЗДАТЬ БЕСКОНЕЧНЫЙ ЦИКЛ ВЫГЛЯДИТ ТАК
# while True:
#     print('Python is awesome')




#                                                          БЛОК else ЦИКЛАХ
# Python ДОПУСКАЕТ else В КОНЦЕ ЦИКЛА while И for  
# СИНТАКСИС ЭТОГО ВЫГЛЯДИТ ТАК 

# while условие:
#     блок кода1
# else:
#     блок кода2 

# ИЛИ

# for i in range(10):
#     блок кода1
# else:
#     блок кода2 

# БЛОК КОДА2 БУДЕТ ВЫПОНЕН КОГДА ШТАТНЫМ ОБРАЗОМ ЗАВЕРШИТЬСЯ ЦИКЛ while ИЛИ for
# МОЖНО ПОДУМАТЬ ЧТО НЕТ СМЫСЛА В else , ВЕДЬ МОЖНО ПОМЕСТИТЬ БЛОК КОДА2 СРАЗУ ПОСЛЕ ЦИКЛА 
# НО ЕСЛИ СЛОВО else ОТСУТСТВУЕТ ТО БЛОК КОДА БУДЕТ ВЫПОЛНЯТЬСЯ ПОСЛЕ ЗАВЕРШЕНИЯ ЦИКЛА , НЕСМОТРЯ НИ НА ЧТО 
# ЕСЛИ ЖЕ СЛОВО ЕСТЬ ТО БЛОК КОДА 2 БУДЕТ ВЫПОЛНЯТЬСЯ ТОЛЬКО ТОГДА КОГДА ЦИКЛ ЗАВЕРШИТЬСЯ ШТАТНЫМ ОБРАЗОМ 
# ТО ЕСТЬ ОН ЗАВЕРШИТЬСЯ БЕЗ ОПЕРАТОРА break

# РАССМОТРИМ СЛЕДУЮЩИЙ ПРОГРАММНЫЙ КОД

# n = 5

# while n > 0:
#     n -= 1
#     print(n)
# else:
#     print('STOP CYCLES')
# ДАННЫЙ ЦИКЛ ПОВТОРЯЕТЬСЯ ПОКА n > 0 .
# ПОСКОЛЬКУ ЦИКЛ ШТАТНО ЗАВЕРШИЛСЯ ТО БЛОК КОДА В else БУДЕТ ВЫПОЛНЕН 
# И МЫ ПОЛУЧИМ: 
# 4
# 3
# 2
# 1
# 0
# STOP CYCLES

# РАССМОТРИМ СЛЕДУЮЩИЙ ПРОГРАММНЫЙ КОД

# n = 5

# while n > 0:
#     n -= 1
#     print(n)
#     if n == 2:
#         break
# else:
#     print('STOP CYCLES')

# ЭТОТ ЦИКЛ ЗАВЕРШАЕТСЯ ПРЕЖДЕВРЕМЕННО С ПОМОЩЬЮ break ПОЭТОМУ БЛОК КОДА В else НЕ БУДЕТ ВЫПОЛНЕН
# РЕЗУЛЬТАТОМ ТАКОГО КОДА БУДЕТ 
# 4
# 3
# 2
# ГВИДО ВАН РОССУМ СКАЗАЛ ЧТО УБРАЛ БЫ else ИЗ ЦИКЛОВ ЕСЛИ БЫ СНОВА ПРОЕКТИРОВАЛ ПАЙТОН
# ПРОГРАММА ЧТО ОПРЕДЕЛЯЕТ ЕСТЬ ЛИ ЦИФРА 7 В ЧИСЛЕ 

# num = int(input())
# n = num
# flag = False

# while n != 0:
#     last = n % 10
#     if last == 7:
#         flag = True
#         break # прерываем цикл, так как число гарантированно содержит цифру 7
#     n //= 10

# if flag == True:
#     print('Число', num, 'содержит цифру 7')
# else:
#     print('Число', num, 'не содержит цифру 7')

# НО ВМЕСТО ЭТОГО МОЖНО ИСПОЛЬЗОВАТЬ ЭТОТ КОД :
 
# num = int(input())
# n = num 

# while n != 0:
#     last = n % 10 
#     if last == 7:
#         print('Число', num, 'содержит цифру 7')
#         break
#     n //= 10 
# else:
#     print('Число', num, 'не содержит цифру 7')


# num = int(input())
# flag = True

# for i in range(2, int(num ** 0.5) + 1):
#     if num % i == 0:
#         flag = False

# if num == 1:
#     print('Число равно 1')
# elif flag == True:
#     print('Число простое')
# else:
#     print('Число составное')
